yckb1297/stm32f411-uart-pwm-motor-control/Motor_Control_REV1.1/device_driver.h
#include "stm32f4xx.h"
#include "option.h"
#include "macro.h"
#include "malloc.h"

#define PC13			13U
#define	EXTI15_10		(IRQn_Type)40U

#define TIM2_INT_POS	(IRQn_Type)28U
#define TIM4_INT_POS	(IRQn_Type)30U


typedef enum t_MOTOR_STATE
{
	STOP = 0U,
	CW = 1U,
	CCW = 2U,
	SHORT_STOP = 3u
} MOTOR_STATE;

typedef enum t_KEY_STATE
{
	KEY_IDLE = 0U,		// IDLE
	IS_PRESSED = 1U,	// Falling
	IS_RELEASED = 2U	// Rising
} KEY_STATE;

typedef enum t_MOTOR_SPEED{
    SPD_1 = 50,
    SPD_2 = 55,
    SPD_3 = 60,
    SPD_4 = 65,
    SPD_5 = 70,
    SPD_6 = 75,
    SPD_7 = 80,
    SPD_8 = 85,
    SPD_9 = 90
} MOTOR_SPEED;

extern const MOTOR_SPEED speed_table[10];

//gpio.c

extern void GPIO_Init(void);
extern void GPIO_Mode_CW(void);
extern void GPIO_Mode_CCW(void);
extern void GIPO_Mode_Stop(void);

// Uart.c

extern void Uart2_Init(int baud);
extern void Uart2_RX_Interrupt_Enable(void);
extern void Uart2_Send_Byte(char data);

// SysTick.c

extern void SysTick_Run(unsigned int msec);
extern int SysTick_Check_Timeout(void);
extern unsigned int SysTick_Get_Time(void);
extern unsigned int SysTick_Get_Load_Time(void);
extern void SysTick_Stop(void);

// Led.c

extern void LED_Init(void);
extern void LED_On(void);
extern void LED_Off(void);

// Clock.c

extern void Clock_Init(void);

// Key.c


extern int Key_Get_Pressed(void);
extern void Key_ISR_Enable(int en);

// Timer.c
extern void TIM2_3sec_Timer_Start(void);
extern int TIM2_Check_Timeout(void);
extern void TIM2_Stop(void);

extern void TIM4_Delay(int time);
extern void TIM4_Delay_Interrupt_Enable(int time);

extern void TIM5_Out_Init(void);
extern void TIM5_PWM_Generation(int duty);

// Motor.c

extern void Toggle_Motor_State(MOTOR_STATE *state);
extern void Toggle_with_Short_Stop(MOTOR_STATE *state, MOTOR_STATE next_state);
extern void Motor_Stop(void);
extern void Motor_Short_Stop(void);
extern void Motor_CW(void);
extern void Motor_CCW(void);
